tutorials/multiphase/compressibleInterPhaseTransportFoam/climbingRod/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication extrudeMesh

rm -rf 0 2> /dev/null
cp -r 0.orig 0
runApplication setFields
runApplication $application

#------------------------------------------------------------------------------
